[Killed] BlockStatement
src/calculator.ts:1:51
-export function podeVotar(idade: number): boolean {
-    if (idade >= 16) {
-        return true;
-    }
-    return false;
-}
+export function podeVotar(idade: number): boolean {}
killedBy: Testes da função podeVotar deve retornar true para quem tem mais de 16 anos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/calculator.ts:2:9
 export function podeVotar(idade: number): boolean {
-    if (idade >= 16) {
+    if (false) {
         return true;
     }
killedBy: Testes da função podeVotar deve retornar true para quem tem mais de 16 anos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/calculator.ts:2:9
 export function podeVotar(idade: number): boolean {
-    if (idade >= 16) {
+    if (idade < 16) {
         return true;
     }
killedBy: Testes da função podeVotar deve retornar true para quem tem mais de 16 anos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/calculator.ts:3:16
 export function podeVotar(idade: number): boolean {
     if (idade >= 16) {
-        return true;
+        return false;
     }
     return false;
killedBy: Testes da função podeVotar deve retornar true para quem tem mais de 16 anos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
